Documents/ПланПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПланПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланыПродаж</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МодулиИПодсистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиентовСреднее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СебестоимостьПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаБлюда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыБлюд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКлиентов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКлиентовСреднее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЦП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийЧек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредняяТранзакция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВаловыйДоход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПланПродаж/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Создание.
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = НЕ ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.СоставПлана.Количество() > 0 Тогда
		Ответ = Вопрос("Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСоставПлана();
	ЗаполнитьКолонкиТабличнойЧасти();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставПлана()
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСоставПлана();
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКолонкиТабличнойЧасти(Колонка = "")
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьКолонкиТабличнойЧасти(Колонка);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКлиентовПриИзменении(Элемент)
	ЗаполнитьКолонкиТабличнойЧасти(Элемент.Имя);
	РассчитатьПоказателиТабличнойЧасти();
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКлиентовСреднееПриИзменении(Элемент)
	ЗаполнитьКолонкиТабличнойЧасти(Элемент.Имя);
	РассчитатьПоказателиТабличнойЧасти();
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПроцентПриИзменении(Элемент)
	ЗаполнитьКолонкиТабличнойЧасти(Элемент.Имя);
	РассчитатьПоказателиТабличнойЧасти();
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СебестоимостьПроцентПриИзменении(Элемент)
	ЗаполнитьКолонкиТабличнойЧасти(Элемент.Имя);
	РассчитатьПоказателиТабличнойЧасти();
	ОбновитьПодвал();
КонецПроцедуры
 
&НаКлиенте
Процедура СоставПланаКЦППриИзменении(Элемент)
	РассчитатьПоказателиТабличнойЧасти(Элементы.СоставПлана.ТекущиеДанные.НомерСтроки);
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаЦенаПриИзменении(Элемент)
	РассчитатьПоказателиТабличнойЧасти(Элементы.СоставПлана.ТекущиеДанные.НомерСтроки);
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаСкидкаПроцентПриИзменении(Элемент)
	РассчитатьПоказателиТабличнойЧасти(Элементы.СоставПлана.ТекущиеДанные.НомерСтроки);
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаСебестоимостьПроцентПриИзменении(Элемент)
	РассчитатьПоказателиТабличнойЧасти(Элементы.СоставПлана.ТекущиеДанные.НомерСтроки);
	ОбновитьПодвал();
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоказателиТабличнойЧасти(НомерСтроки = "")
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.РассчитатьПоказателиТабличнойЧасти(НомерСтроки);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвал()
	
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаКоличество.ТекстПодвала 			= Окр(Объект.СоставПлана.Итог("Количество"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаКЦП.ТекстПодвала 					= ?(Объект.КоличествоКлиентов = 0, "", Окр(Объект.СоставПлана.Итог("Количество")/Объект.КоличествоКлиентов, 2));
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаЦена.ТекстПодвала 					= ?(Объект.СоставПлана.Итог("Количество") = 0, "", Окр(Объект.СоставПлана.Итог("Сумма")/Объект.СоставПлана.Итог("Количество"), 2));
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСреднийЧек.ТекстПодвала 			= ?(Объект.КоличествоКлиентов = 0, "", Окр(Объект.СоставПлана.Итог("Сумма")/Объект.КоличествоКлиентов, 2));
	//Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСредняяТранзакция.ТекстПодвала 	= "";
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСуммаБезСкидок.ТекстПодвала 		= Окр(Объект.СоставПлана.Итог("СуммаБезСкидок"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСуммаСкидки.ТекстПодвала 			= Окр(Объект.СоставПлана.Итог("СуммаСкидки"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСкидкаПроцент.ТекстПодвала 			= ?(Объект.СоставПлана.Итог("СуммаБезСкидок") = 0, "", Окр(Объект.СоставПлана.Итог("СуммаСкидки")/Объект.СоставПлана.Итог("СуммаБезСкидок")*100, 2));
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСумма.ТекстПодвала 					= Окр(Объект.СоставПлана.Итог("Сумма"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСебестоимость.ТекстПодвала 			= Окр(Объект.СоставПлана.Итог("Себестоимость"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСебестоимостьПроцент.ТекстПодвала 	= ?(Объект.СоставПлана.Итог("Сумма") = 0, "", Окр(Объект.СоставПлана.Итог("Себестоимость")/Объект.СоставПлана.Итог("Сумма")*100, 2));
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаВаловыйДоход.ТекстПодвала 			= Окр(Объект.СоставПлана.Итог("ВаловыйДоход"), 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаПланирования <> НачалоМесяца(Объект.ДатаПланирования) Тогда
		Объект.ДатаПланирования = НачалоМесяца(Объект.ДатаПланирования);
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Объект.Ссылка.ДатаПланирования)) Тогда
		ЗаполнитьСоставПлана();
		ЗаполнитьКолонкиТабличнойЧасти();
	ИначеЕсли ((Объект.ДатаПланирования <> Объект.Ссылка.ДатаПланирования) И Объект.СоставПлана.Количество()) Тогда
		Ответ = Вопрос("Табличная часть будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Объект.ДатаПланирования = Объект.Ссылка.ДатаПланирования; 
			Возврат;
		КонецЕсли;
		ЗаполнитьСоставПлана();
		ЗаполнитьКолонкиТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры
